In [1]:
import pandas as pd

In [4]:
df = pd.DataFrame(columns=['Name','Age'])
df

Empty DataFrame
Columns: [Name, Age]
Index: []

In [8]:
df.loc[0]=['Allen',22]
df.loc[1]=['Ted',23]
df.loc[2]=['Jack',25]
df.loc[4]=['Tom',25]
df

    Name Age
0  Allen  22
1    Ted  23
2   Jack  25
4    Tom  25

In [10]:
df['Height'] = [175,165,180,178]
df

    Name Age  Height
0  Allen  22     175
1    Ted  23     165
2   Jack  25     180
4    Tom  25     178

In [11]:
df.drop(['Height'], axis = 1)
# 暫存結果,不會改變表格

    Name Age
0  Allen  22
1    Ted  23
2   Jack  25
4    Tom  25

In [14]:
df.drop(4)

    Name Age  Height
0  Allen  22     175
1    Ted  23     165
2   Jack  25     180

In [20]:
df['Age'][0] = 80
df

C:\Users\User\anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

    Name Age  Height
0  Allen  80     175
1    Ted  23     165
2   Jack  25     180
4    Tom  25     178

In [22]:
df.loc[0]=123 #change the value of whole row
df

   Name  Age  Height
0   123  123     123
1   Ted   23     165
2  Jack   25     180
4   Tom   25     178

In [25]:
columns = ['Name','Age']
row1 = ['Allen', 22]
row2 = ['Ted', 25]
data = [row1, row2]

df = pd.DataFrame(data=data, columns=columns)
df

    Name  Age
0  Allen   22
1    Ted   25